<a href="https://colab.research.google.com/github/TeckHack76/Python_Worksheet/blob/main/Worksheet_7a.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#q1.1
import pandas as pd
print(pd.__version__)

2.2.2

In [2]:
#q1.2
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [3]:
#q2.1
S1 = pd.Series([100, 200, 300, 400, 500])
print(S1)

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [4]:
#q2.2
print(S1[1], S1[3])

200 400

In [5]:
#q2.3
S2 = pd.Series([10, 20, 30, 40, 50])
result = S1 + S2
print(result)

0    110
1    220
2    330
3    440
4    550
dtype: int64

In [6]:
#q3.1
print(df[['Name', 'City']])

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [7]:
#q3.2
df['Salary'] = [50000, 60000, 70000]
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [8]:
#q3.3
average_age = df['Age'].mean()
total_salary = df['Salary'].sum()
print(f"Average Age: {average_age}")
print(f"Total Salary: {total_salary}")

Average Age: 30.0
Total Salary: 180000

In [9]:
#q4.1
filtered_df = df[df['Age'] > 28]
print(filtered_df)

      Name  Age         City  Salary
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [10]:
#q4.2
df_with_index = df.set_index('Name')
print(df_with_index)

df_reset = df_with_index.reset_index()
print(df_reset)

         Age         City  Salary
Name
Alice     25     New York   50000
Bob       30  Los Angeles   60000
Charlie   35      Chicago   70000
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [12]:
#q5.1
import csv
data=[
    ['Name', 'Department', 'Salary'],
    ['John', 'Sales', 55000],
    ['Jane', 'Marketing', 60000],
    ['Emily', 'Sales', 58000],
]
filename='employee_data.csv'
with open(filename, 'w', newline='') as file:
    writer = csv.writer(file)
    writer.writerows(data)
df_csv = pd.read_csv('employee_data.csv')
print(df_csv)

    Name Department  Salary
0   John      Sales   55000
1   Jane  Marketing   60000
2  Emily      Sales   58000

In [13]:
#q5.2
filtered_csv = df_csv[df_csv['Salary'] > 55000]
print(filtered_csv[['Name', 'Department']])

    Name Department
1   Jane  Marketing
2  Emily      Sales

In [14]:
#q6.1
grouped = df_csv.groupby('Department')['Salary'].mean()
print(grouped)

Department
Marketing    60000.0
Sales        56500.0
Name: Salary, dtype: float64

In [15]:
#q6.2
agg_result = df_csv.groupby('Department')['Salary'].agg(['min', 'max'])
print(agg_result)

              min    max
Department
Marketing   60000  60000
Sales       55000  58000

In [16]:
#q7.1
df1 = pd.DataFrame({'Name': ['John', 'Jane', 'Emily'], 'Department': ['Sales', 'Marketing', 'HR']})
df2 = pd.DataFrame({'Name': ['John', 'Jane', 'Emily'], 'Experience (Years)': [5, 7, 3]})
merged_df = pd.merge(df1, df2, on='Name')
print(merged_df)

    Name Department  Experience (Years)
0   John      Sales                   5
1   Jane  Marketing                   7
2  Emily         HR                   3

In [17]:
#q8.1
sorted_df = merged_df.sort_values(by='Experience (Years)', ascending=False)
print(sorted_df)

    Name Department  Experience (Years)
1   Jane  Marketing                   7
0   John      Sales                   5
2  Emily         HR                   3